Repository: railduino/gd-tools
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: de_de

source: delete-flag-force
de_de: erzwingt das Löschen ohne Nachfrage

source: delete-cmd-usage
de_de: löscht ein bestehendes Projekt

source: delete-cmd-describe
de_de: Der Befehl 'delete' dient dazu, ein vorhandenes Projekt zu löschen Vor dem Löschen sollte das Projekt auf dem Server 'down' sein. Sonst wird nach einem 'deploy' die 'compose.yaml' nicht mehr gefunden.

source: delete-err-no-arg
de_de: kein Projekt zum Löschen angegeben

source: delete-err-not-found
de_de: Projekt '%s' wurde nicht gefunden

source: delete-err-not-dir
de_de: das Ziel '%s' ist kein Verzeichnis

source: delete-err-no-force
de_de: zur Sicherheit muss --force angegeben werden

source: deploy-cmd-usage
de_de: aktualisiert das Produktions-System

source: deploy-cmd-describe
de_de: Der Befehl 'deploy' macht etwas. TODO Genaueres steht dann hier.

source: enable-cmd-usage
de_de: erteilt Startfreigabe für Projekt oder Service

source: enable-cmd-describe
de_de: Der Befehl 'enable' macht etwas. TODO Genaueres steht dann hier.

source: generate-flag-depends
de_de: erstellt Abhängigkeit(en) von Projekt(en)

source: generate-cmd-usage
de_de: erzeugt ein neues Projekt einer bestimmten Art

source: generate-cmd-describe
de_de: Der Befehl 'generate' macht etwas. TODO Genaueres steht dann hier.

source: generate-cmd-list-kinds
de_de: Die folgenden Projekt-Arten sind implementiert:

source: generate-err-prefix-missing
de_de: bitte ein Präfix (Zahl von 0 bis 99) angeben

source: generate-err-name-missing
de_de: bitte einen Namen für das Projekt vergeben

source: generate-err-prefix-numeric
de_de: das Präfix muss eine Zahl von 0 bis 99 sein

source: git-cmd-usage
de_de: füllt das (bestehende, leere) Server-Repository

source: git-cmd-describe
de_de: Der Befehl 'git' macht etwas. TODO Genaueres steht dann hier.

source: hash-cmd-usage
de_de: erzeugt eine Prüfsumme

source: hash-cmd-describe
de_de: Der Befehl 'hash' macht etwas. TODO Genaueres steht dann hier.

source: links-flag-dir
de_de: zeigt die Kommandos, ohne sie auszuführen

source: links-cmd-usage
de_de: bereitet das Produktions-System für die Nutzung von gd-tools vor

source: links-cmd-describe
de_de: Der Befehl 'system' ist verantwortlich für das Setup des Host-Systems. In der Entwicklungsumgebung wird die Datei system.json editiert. In der Produktionsumgebung wird das System für gd-tools eingerichtet.

source: list-flag-status
de_de: filtert Projekte nach ihrem Status

source: list-cmd-usage
de_de: listet die bestehenden Projekte auf

source: list-cmd-describe
de_de: Der Befehl 'list' macht etwas. TODO Genaueres steht dann hier.

source: list-status-unknown
de_de: dieser Status ist nicht bekannt

source: login-flag-root
de_de: zeigt die Kommandos, ohne sie auszuführen

source: login-cmd-usage
de_de: meldet sich auf dem Produktions-System an

source: login-cmd-describe
de_de: Der Befehl 'login' macht etwas. TODO Genaueres steht dann hier.

source: secrets-cmd-usage
de_de: erzeugt einen geheimen Schlüssel

source: secrets-cmd-describe
de_de: Der Befehl 'secret' macht etwas. TODO Genaueres steht dann hier.

source: setup-cmd-usage
de_de: bereitet das Produktions-System für die Nutzung von gd-tools vor

source: setup-cmd-describe
de_de: Der Befehl 'setup' legt die Basis für einen produktiven Server TODO Genaueres steht dann hier. Beispiel: gd-tools setup ~/gd-servers/www.example.com

source: setup-err-missing-host
de_de: es wurde kein Name für den Server angegeben

source: setup-err-host-exist
de_de: der Server '%s' existiert bereits, Ausführung verweigert

source: setup-step-mkdir
de_de: Step: legt das Verzeichnis für den Server an

source: setup-step-system
de_de: Step: erzeugt die JSON-Dateien für die Umgebung

source: system-flag-progress
de_de: der FQDN wird auf %s gesetzt

source: system-flag-upgrade
de_de: der FQDN wird auf %s gesetzt

source: system-cmd-usage
de_de: bereitet das Produktions-System für die Nutzung von gd-tools vor

source: system-cmd-describe
de_de: Der Befehl 'system' ist verantwortlich für das Setup des Host-Systems. In der Entwicklungsumgebung wird die Datei system.json editiert. Auf dem Produktions-System wird die Umgebung für gd-tools eingerichtet.

source: system-only-root
de_de: die Zeitzone %s ist bereits gesetzt

source: system-timezone-okay
de_de: die Zeitzone %s ist bereits gesetzt

source: system-timezone-update
de_de: die Zeitzone wird auf %s gesetzt

source: system-hostname-okay
de_de: der FQDN ist bereits auf %s gesetzt

source: system-hostname-update
de_de: der FQDN wird auf %s gesetzt

source: system-swapfile-zero
de_de: es wird kein Swap-File angefordert

source: system-swapfile-exist
de_de: das Swap-File %s existiert bereits

source: system-swapfile-fstab
de_de: das Swap-File %s wird in /etc/fstab eingetragen

source: system-list_ids
de_de: die IDs sind %s:%s (gd-tools) bzw. :%s (docker)

source: update-cmd-usage
de_de: löscht ein bestehendes Projekt

source: update-cmd-describe
de_de: Der Befehl 'delete' dient dazu, ein vorhandenes Projekt zu löschen Vor dem Löschen sollte das Projekt auf dem Server 'down' sein. Sonst wird nach einem 'deploy' die 'compose.yaml' nicht mehr gefunden.

source: generate-create-config
de_de: legt die Datei 'config.json' an

source: generate-create-compose
de_de: legt die Datei 'compose.yaml' an

source: generate-create-dir
de_de: legt das Projekt-Verzeichnis an

source: generate-create-index
de_de: legt das Projekt-Verzeichnis an

source: generate-wordpress-usage
de_de: installiert einen Traefik Reverse Proxy Container

source: generate-wordpress-describe
de_de: Traefik (https://traefik.io/traefik/) ist ein moderner Reverse Proxy. TODO - weitere Beschreibung, und warum i.d.R. das erste Projekt.

# main-flag-commands
source: Available commands:
de_de: zeigt eine Liste der erkannten Befehle

source: main-flag-dry-run
de_de: zeigt die Kommandos, ohne sie auszuführen

# usage-main-app
source: Toolset for managing Docker based projects under Debian/Ubuntu Linux
de_de: Toolset zur Verwaltung von Docker-Projekten unter Debian/Ubuntu Linux

# app-action-commands
source: Available commands:
de_de: Die folgenden Befehle werden erkannt:

source: install-err-unique-exist
de_de: von dieser Projekt-Art darf es nur eine Instanz geben

source: system-err-missing-file
de_de: das Swap-File %s existiert bereits

source: system-err-missing-ids
de_de: das Swap-File %s existiert bereits

source: secret-err-unknown-mode
de_de: zur Sicherheit muss --force angegeben werden

source: exec-dry-running
de_de: [dry] %s

source: exec-now-running
de_de: [run] %s

source: exec-err-missing
de_de: da fehlt etwas

source: exec-err-invalid
de_de: da ist etwas ungültig

source: uuid-err-missing-device
de_de: keine deploy.json - sind wir im richtigen Verzeichnis?

source: yaml-err-invalid-depends
de_de: ungültige Abhängigkeit erkannt

source: yaml-err-invalid-kvlist
de_de: ungültige Liste erkannt

source: yaml-err-unexpected-kvlist
de_de: hier wird keine Liste erwartet
